{
  "architectures": [
    "XCLIPModel"
  ],
  "bos_token_id": 49406,
  "dtype": "float32",
  "eos_token_id": 49407,
  "initializer_factor": 1.0,
  "logit_scale_init_value": 2.6592,
  "model_type": "xclip",
  "pad_token_id": 49407,
  "projection_dim": 512,
  "prompt_alpha": 0.1,
  "prompt_attention_dropout": 0.0,
  "prompt_hidden_act": "quick_gelu",
  "prompt_layers": 2,
  "prompt_num_attention_heads": 8,
  "prompt_projection_dropout": 0.0,
  "text_config": {
    "attention_dropout": 0.0,
    "dropout": 0.0,
    "dtype": "float32",
    "hidden_act": "quick_gelu",
    "hidden_size": 512,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 2048,
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 77,
    "model_type": "xclip_text_model",
    "num_attention_heads": 8,
    "num_hidden_layers": 12,
    "vocab_size": 49408
  },
  "transformers_version": "4.57.3",
  "vision_config": {
    "attention_dropout": 0.0,
    "drop_path_rate": 0.0,
    "dropout": 0.0,
    "dtype": "float32",
    "hidden_act": "quick_gelu",
    "hidden_size": 768,
    "image_size": 224,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-05,
    "mit_hidden_size": 512,
    "mit_intermediate_size": 2048,
    "mit_num_attention_heads": 8,
    "mit_num_hidden_layers": 1,
    "model_type": "xclip_vision_model",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_frames": 8,
    "num_hidden_layers": 12,
    "patch_size": 32
  }
}
